tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1574_tdd.h
#define PWM4PRH5                      1091
#define PWM4PRH6                      1092
#define PWM4PRH7                      1093
#define PWM4OFL0                      1094
#define PWM4OFL                       1095
#define PWM4OFL_OF                    1096
#define PWM4OFL1                      1097
#define PWM4OFL2                      1098
#define PWM4OFL3                      1099
#define PWM4OFL4                      1100
#define PWM4OFL5                      1101
#define PWM4OFL6                      1102
#define PWM4OFL7                      1103
#define PWM4OFH                       1104
#define PWM4OFH_OF                    1105
#define PWM4OFH0                      1106
#define PWM4OFH1                      1107
#define PWM4OFH2                      1108
#define PWM4OFH3                      1109
#define PWM4OFH4                      1110
#define PWM4OFH5                      1111
#define PWM4OFH6                      1112
#define PWM4OFH7                      1113
#define PWM4TMRL0                     1114
#define PWM4TMRL_TMR                  1115
#define PWM4TMRL                      1116
#define PWM4TMRL1                     1117
#define PWM4TMRL2                     1118
#define PWM4TMRL3                     1119
#define PWM4TMRL4                     1120
#define PWM4TMRL5                     1121
#define PWM4TMRL6                     1122
#define PWM4TMRL7                     1123
#define PWM4TMRH                      1124
#define PWM4TMRH_TMR                  1125
#define PWM4TMRH0                     1126
#define PWM4TMRH1                     1127
#define PWM4TMRH2                     1128
#define PWM4TMRH3                     1129
#define PWM4TMRH4                     1130
#define PWM4TMRH5                     1131
#define PWM4TMRH6                     1132
#define PWM4TMRH7                     1133
#define PWM4CON                       1134
#define PWM4MODE                      1135
#define PWM4MODE0                     1136
#define PWM4CON_MODE                  1137
#define PWM4CON_MODE0                 1138
#define PWM4CON_MODE1                 1139
#define PWM4MODE1                     1140
#define PWM4POL                       1141
#define PWM4CON_POL                   1142
#define PWM4CON_OUT                   1143
#define PWM4OUT                       1144
#define PWM4CON_OE                    1145
#define PWM4OE                        1146
#define PWM4EN                        1147
#define PWM4CON_EN                    1148
#define PWM4INTE                      1149
#define PWM4INTE_PRIE                 1150
#define PWM4PRIE                      1151
#define PWM4INTE_DCIE                 1152
#define PWM4DCIE                      1153
#define PWM4PHIE                      1154
#define PWM4INTE_PHIE                 1155
#define PWM4OFIE                      1156
#define PWM4INTE_OFIE                 1157
#define PWM4INTF                      1158
#define PWM4PRIF                      1159
#define PWM4INTF_PRIF                 1160
#define PWM4INTF_DCIF                 1161
#define PWM4DCIF                      1162
#define PWM4PHIF                      1163
#define PWM4INTF_PHIF                 1164
#define PWM4OFIF                      1165
#define PWM4INTF_OFIF                 1166
#define PWM4CLKCON                    1167
#define PWM4CLKCON_CS0                1168
#define PWM4CS                        1169
#define PWM4CLKCON_CS                 1170
#define PWM4CS0                       1171
#define PWM4CLKCON_CS1                1172
#define PWM4CS1                       1173
#define PWM4PS0                       1174
#define PWM4CLKCON_PS0                1175
#define PWM4CLKCON_PS                 1176
#define PWM4PS                        1177
#define PWM4PS1                       1178
#define PWM4CLKCON_PS1                1179
#define PWM4PS2                       1180
#define PWM4CLKCON_PS2                1181
#define PWM4LDCON                     1182
#define PWM4LDS                       1183
#define PWM4LDCON_LDS0                1184
#define PWM4LDCON_LDS                 1185
#define PWM4LDS0                      1186
#define PWM4LDCON_LDS1                1187
#define PWM4LDS1                      1188
#define PWM4LDM                       1189
#define PWM4LDCON_LDT                 1190
#define PWM4LDCON_LDA                 1191
#define PWM4LD                        1192
#define PWM4OFCON                     1193
#define PWM4OFCON_OFS                 1194
#define PWM4OFS                       1195
#define PWM4OFCON_OFS0                1196
#define PWM4OFS0                      1197
#define PWM4OFCON_OFS1                1198
#define PWM4OFS1                      1199
#define PWM4OFMC                      1200
#define PWM4OFCON_OFO                 1201
#define PWM4OFM0                      1202
#define PWM4OFM                       1203
#define PWM4OFCON_OFM0                1204
#define PWM4OFCON_OFM                 1205
#define PWM4OFM1                      1206
#define PWM4OFCON_OFM1                1207
#define PPSLOCK                       1208
#define PPSLOCKED                     1209
#define INTPPS0                       1210
#define INTPPS                        1211
#define INTPPS1                       1212
#define INTPPS2                       1213
#define INTPPS3                       1214
#define INTPPS4                       1215
#define T0CKIPPS0                     1216
#define T0CKIPPS                      1217
#define T0CKIPPS1                     1218
#define T0CKIPPS2                     1219
#define T0CKIPPS3                     1220
#define T0CKIPPS4                     1221
#define T1CKIPPS0                     1222
#define T1CKIPPS                      1223
#define T1CKIPPS1                     1224
#define T1CKIPPS2                     1225
#define T1CKIPPS3                     1226
#define T1CKIPPS4                     1227
#define T1GPPS0                       1228
#define T1GPPS                        1229
#define T1GPPS1                       1230
#define T1GPPS2                       1231
#define T1GPPS3                       1232
#define T1GPPS4                       1233
#define CWG1INPPS0                    1234
#define CWG1INPPS                     1235
#define CWG1INPPS1                    1236
#define CWG1INPPS2                    1237
#define CWG1INPPS3                    1238
#define CWG1INPPS4                    1239
#define RXPPS0                        1240
#define RXPPS                         1241
#define RXPPS1                        1242
#define RXPPS2                        1243
#define RXPPS3                        1244
#define RXPPS4                        1245
#define CKPPS                         1246
#define CKPPS0                        1247
#define CKPPS1                        1248
#define CKPPS2                        1249
#define CKPPS3                        1250
#define CKPPS4                        1251
#define ADCACTPPS0                    1252
#define ADCACTPPS                     1253
#define ADCACTPPS1                    1254
#define ADCACTPPS2                    1255
#define ADCACTPPS3                    1256
#define ADCACTPPS4                    1257
#define RA0PPS                        1258
#define RA0PPS0                       1259
#define RA0PPS1                       1260
#define RA0PPS2                       1261
#define RA0PPS3                       1262
#define RA1PPS                        1263
#define RA1PPS0                       1264
#define RA1PPS1                       1265
#define RA1PPS2                       1266
#define RA1PPS3                       1267
#define RA2PPS                        1268
#define RA2PPS0                       1269
#define RA2PPS1                       1270
#define RA2PPS2                       1271
#define RA2PPS3                       1272
#define RA4PPS                        1273
#define RA4PPS0                       1274
#define RA4PPS1                       1275
#define RA4PPS2                       1276
#define RA4PPS3                       1277
#define RA5PPS                        1278
#define RA5PPS0                       1279
#define RA5PPS1                       1280
#define RA5PPS2                       1281
#define RA5PPS3                       1282
#define RC0PPS                        1283
#define RC0PPS0                       1284
#define RC0PPS1                       1285
#define RC0PPS2                       1286
#define RC0PPS3                       1287
#define RC1PPS_RC1PPS0                1288
#define RC1PPS                        1289
#define RC1PPS_RC1PPS1                1290
#define RC1PPS_RC1PPS2                1291
#define RC1PPS_RC1PPS3                1292
#define RC2PPS_RC1PPS0                1293
#define RC2PPS                        1294
#define RC2PPS_RC1PPS1                1295
#define RC2PPS_RC1PPS2                1296
#define RC2PPS_RC1PPS3                1297
#define RC3PPS                        1298
#define RC3PPS0                       1299
#define RC3PPS1                       1300
#define RC3PPS2                       1301
#define RC3PPS3                       1302
#define RC4PPS0                       1303
#define RC4PPS                        1304
#define RC4PPS1                       1305
#define RC4PPS2                       1306
#define RC4PPS3                       1307
#define RC5PPS0                       1308
#define RC5PPS                        1309
#define RC5PPS1                       1310
#define RC5PPS2                       1311
#define RC5PPS3                       1312
#define STATUS_SHAD                   1313
#define C_SHAD                        1314
#define DC_SHAD                       1315
#define Z_SHAD                        1316
#define WREG_SHAD                     1317
#define BSR_SHAD                      1318
#define PCLATH_SHAD                   1319
#define FSR0L_SHAD                    1320
#define FSR0H_SHAD                    1321
#define FSR1L_SHAD                    1322
#define FSR1H_SHAD                    1323
#define STKPTR                        1324
#define TOSL                          1325
#define TOSH                          1326

#endif // _PIC16F1574_H_
